{
    "header": {
      "logo": "Assets/image1.png",
      "navLinks": [
        {"text": "Home", "url": "index.html"},
        {"text": "Sri Lankan Wildlife Introduction", "url": "introduction.html"},
        {"text": "Department of Wildlife Conservation", "url": "department.html"},
        {"text": "Sri Lankan Leopard", "url": "leopard.html"},
        {"text": "Animals in Sri Lanka", "url": "animals.html"}
      ]
    },
    "sections": [
      {
        "id": "M",
        "indigenousAnimals": {
          "title": "Indigenous animals in Sri Lanka",
          "description": "Sri Lanka, a biodiversity hotspot, is home to a rich array of indigenous animals, showcasing the country's unique ecological diversity. The island's lush landscapes harbor a variety of fauna, many of which are found nowhere else on Earth. The Sri Lankan elephant, an iconic species, roams freely in the country's national parks, symbolizing the importance of wildlife conservation. The Sri Lankan leopard, a subspecies of the larger Indian leopard, is another charismatic native species. Known for its elusive nature, the leopard finds sanctuary in protected areas like Yala National Park. Meanwhile, the purple-faced langur, an endemic primate, swings through the treetops of Sri Lanka's rainforests. The island's waters are home to diverse marine life, including the Sri Lankan blue whale, the largest animal on the planet. Coastal areas host sea turtles, such as the endangered loggerhead and leatherback species, which return to the beaches to nest. Conservation efforts are crucial to safeguard these indigenous animals and their habitats, as human activities and habitat loss pose ongoing threats. Sri Lanka's commitment to preserving its unique wildlife contributes to global biodiversity conservation and serves as a reminder of the importance of protecting the planet's natural wonders."
        }
      },
      {
        "id": "flex",
        "surfLinks": [
          {"image": "Assets/image37.webp", "text": "Click to Surf Yala", "url": "yala.html"},
          {"image": "Assets/image38.jpg", "text": "Click to Surf Wilpattu", "url": "wilpattu.html"}
        ]
      }
    ],
    "footer": {
      "navLinks": [
        {"text": "Home", "url": "index.html"},
        {"text": "Sri Lankan Wildlife Introduction", "url": "introduction.html"},
        {"text": "Department of Wildlife Conservation", "url": "department.html"},
        {"text": "Sri Lankan Leopard", "url": "leopard.html"},
        {"text": "Animals in Sri Lanka", "url": "animals.html"}
      ],
      "copyright": "&copy; Akila Bandara Yainna 2024. All rights reserved",
      "references": [
        {"source": "Animalia.bio", "url": "https://www.animalia.bio/endemic-lists/country/endemic-animals-of-sri-lanka"}
      ]
    }
  }
  