{
    "header": {
      "logo": "Assets/image1.png",
      "navLinks": [
        {"text": "Home", "url": "index.html"},
        {"text": "Sri Lankan Wildlife Introduction", "url": "introduction.html"},
        {"text": "Department of Wildlife Conservation", "url": "department.html"},
        {"text": "Sri Lankan Leopard", "url": "leopard.html"},
        {"text": "Animals in Sri Lanka", "url": "animals.html"},
        {"text": "Login", "url": "login.html"}
      ]
    },
    "sections": [
      {
        "id": "E",
        "quote": "<i>\"Sri Lankan wildlife, a mesmerizing symphony of biodiversity, enchants the soul with its unique melodies. From the majestic elephants that gracefully roam to the elusive leopards that dance within the shadows, the lush landscapes of Sri Lanka harbor tales of resilience and harmony in the vibrant tapestry of nature's masterpiece.</i>",
        "intro": {
          "image": "Assets/png-transparent-flag-of-sri-lanka-national-flag-country-flag-miscellaneous-flag-food-removebg-preview.png",
          "title": "Wild Life Locations",
          "content": "Sri Lanka's diverse ecosystems offer a myriad of wildlife experiences beyond Yala and Wilpattu. In Udawalawe National Park, visitors witness herds of elephants against a picturesque backdrop of rolling grasslands and shimmering reservoirs. Horton Plains National Park, with its misty landscapes, is home to the elusive sambar deer and colorful highland bird species. The Sinharaja Rainforest, a UNESCO World Heritage Site, shelters countless endemic species, from vibrant butterflies to the purple-faced langur. Bundala National Park, a Ramsar Wetland site, attracts bird enthusiasts with its migratory flocks, including flamingos and pelicans. These locations collectively contribute to Sri Lanka's reputation as a wildlife enthusiast's paradise."
        },
        "locations": [
          {
            "name": "Udawalawe National Park",
            "image": "Assets/image20.jpg",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d53339.67033708238!2d80.85530443225436!3d6.45882911279619!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3ae408ff88887e79%3A0xaf12e79ffbd980d7!2sUdawalawe%20National%20Park",
            "description": "Sri Lanka's diverse ecosystems offer a myriad of wildlife experiences beyond Yala and Wilpattu. In Udawalawe National Park, visitors witness herds of elephants against a picturesque backdrop of rolling grasslands and shimmering reservoirs. Horton Plains National Park, with its misty landscapes, is home to the elusive sambar deer and colorful highland bird species. The Sinharaja Rainforest, a UNESCO World Heritage Site, shelters countless endemic species, from vibrant butterflies to the purple-faced langur. Bundala National Park, a Ramsar Wetland site, attracts bird enthusiasts with its migratory flocks, including flamingos and pelicans. These locations collectively contribute to Sri Lanka's reputation as a wildlife enthusiast's paradise."
          },
          {
            "name": "Horton Plains National Park",
            "image": "Assets/image22.jpg",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3961.674038567171!2d80.79975837475597!3d6.809445993188055!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3ae3882edb4b78ef%3A0xcebca89153777249!2sHorton%20Plains%20National%20Park",
            "description": "Horton Plains National Park, situated in Sri Lanka's central highlands, offers a captivating blend of unique biodiversity and breathtaking landscapes. This protected area, characterized by rolling grasslands and cloud forests, is a haven for wildlife enthusiasts. Among its inhabitants are the elusive sambar deer gracefully navigating through the mist-kissed plains. <br><br> The park is also home to an array of avian wonders, including the colorful and endemic Sri Lanka whistling thrush. Visitors can witness the surreal beauty of Baker's Falls and World's End, two iconic landmarks within the park. Horton Plains National Park stands as a testament to Sri Lanka's commitment to preserving its natural heritage."
          },
          {
            "name": "Sinharaja Rainforest",
            "image": "Assets/image24.jpg",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d31718.702912197776!2d80.42327229040549!3d6.414873688852586!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3ae3e76bd109d45f%3A0x8c0ef1010649701b!2sSinharaja%20Forest%20Reserve",
            "description": "Sinharaja Rainforest, a jewel in Sri Lanka's ecological crown, pulsates with biodiversity and endemism. This UNESCO World Heritage Site, nestled in the island's southwest, encapsulates a lush tapestry of flora and fauna. Towering dipterocarp trees embrace a thriving ecosystem where elusive species like the purple-faced langur and the endangered hump-nosed lizard find refuge. <br><br> The air resonates with the melodic calls of vibrant birds, including the Red-faced Malkoha and the Sri Lanka Blue Magpie. Sinharaja's crystal-clear streams harbor unique amphibians, and its forest floor is adorned with exotic orchids and ferns. This ecological haven stands as a testament to the irreplaceable importance of preserving Earth's vanishing rainforests."
          },
          {
            "name": "Bundala National Park",
            "image": "Assets/image26.jpg",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d15866.026699051341!2d81.18855259381615!3d6.196682150655021!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3ae69842ecb214eb%3A0x145a2d402f36beb0!2sBundala%20National%20Park",
            "description": "Bundala National Park, a coastal haven on the southern tip of Sri Lanka, unfolds a captivating tapestry of wildlife within its diverse habitats. A designated Ramsar Wetland of International Importance, Bundala is renowned for its avian treasures. The park hosts an impressive array of migratory birds, including flamboyant flamingos, pelicans, and numerous waterfowl. <br><br>The brackish lagoons and saltpans create an ideal environment for these winged visitors. Beyond its avifauna, Bundala shelters a variety of terrestrial and aquatic species, from crocodiles and spotted deer to vibrant butterflies. This ecologically rich sanctuary stands as a testament to the harmonious coexistence of diverse ecosystems along Sri Lanka's sun-kissed coastline."
          }
        ],
        "table": {
          "title": "Notable Species and Unique Features",
          "rows": [
            {"location": "Udawalawe National Park", "species": "Asian Elephants", "features": "Rolling grasslands, shimmering reservoirs, herds of elephants, diverse birdlife."},
            {"location": "Horton Plains National Park", "species": "Sambar Deer, Sri Lanka Bush Warbler, Highland Birds", "features": "Misty landscapes, cloud forests, endemic species, stunning viewpoints like World's End."},
            {"location": "Sinharaja Rainforest", "species": "Purple-faced Langur, Sri Lanka Frogmouth, Slender Loris", "features": "UNESCO World Heritage Site, rich biodiversity, endemic flora and fauna, dense rainforest canopies."},
            {"location": "Bundala National Park", "species": "Greater Flamingos, Pelicans, Mugger Crocodile", "features": "Ramsar Wetland site, brackish lagoons, saltpans, vibrant migratory birdlife, diverse terrestrial and aquatic species."}
          ],
          "lastUpdate": "Last Update on 13.01.2024"
        }
      }
    ],
    "footer": {
      "navLinks": [
        {"text": "Home", "url": "index.html"},
        {"text": "Sri Lankan Wildlife Introduction", "url": "introduction.html"},
        {"text": "Department of Wildlife Conservation", "url": "department.html"},
        {"text": "Sri Lankan Leopard", "url": "leopard.html"},
        {"text": "Animals in Sri Lanka", "url": "animals.html"},
        {"text": "Subscribe to our Newsletter", "url": "newsletter.html"}
      ],
      "copyright": "&copy; Akila Bandara Yainna 2024. All rights reserved"
    }
  }
  